[SCREEN]
docinfo={background:1,mainfrm:false,type:SCREENI};
grpinfo={max_item_id:23};
itm1={id:1,name:Home,refID:5,type:REFFUNCWIDGET,useinlist:false,useintable:false,useintree:false,visible:true,x:645,y:432};
itm10={backcolor:0,bidimode:left-to-right,content:Current,font:7,height:35,highcolor:0,hlayout:center,id:11,linespacing:0,multiline:false,name:Current,type:TEXTFIELD,visible:true,vlayout:bottom,width:209,wrapline:no-wrap,x:78,y:163,zorder:9};
itm11={backcolor:0,bidimode:left-to-right,content:Air flow,font:7,height:40,highcolor:0,hlayout:left,id:12,linespacing:0,multiline:false,name:Air_flow,type:TEXTFIELD,visible:true,vlayout:middle,width:250,wrapline:no-wrap,x:299,y:310,zorder:10};
itm12={backcolor:0,bidimode:left-to-right,content:50% Chance of rain,font:7,height:40,highcolor:0,hlayout:left,id:13,linespacing:0,multiline:false,name:Chance_of_rain,type:TEXTFIELD,visible:true,vlayout:middle,width:250,wrapline:no-wrap,x:299,y:269,zorder:11};
itm13={backcolor:0,bidimode:left-to-right,content:72/64,font:7,height:40,highcolor:0,hlayout:left,id:14,linespacing:0,multiline:false,name:Fahrenheit_digit,type:TEXTFIELD,visible:true,vlayout:middle,width:72,wrapline:no-wrap,x:299,y:228,zorder:12};
itm14={backcolor:0,bidimode:left-to-right,content:Air condition,font:7,height:40,highcolor:0,hlayout:left,id:15,linespacing:0,multiline:false,name:Air_condition,type:TEXTFIELD,visible:true,vlayout:middle,width:250,wrapline:no-wrap,x:299,y:351,zorder:13};
itm15={backcolor:0,bidimode:left-to-right,content:F,font:14,height:30,highcolor:0,hlayout:left,id:16,linespacing:0,multiline:false,name:Fahrenheit,type:TEXTFIELD,visible:true,vlayout:middle,width:20,wrapline:no-wrap,x:369,y:238,zorder:14};
itm16={backcolor:0,background:493,ccp:0,ccpzorder:over,height:52,id:21,name:Reflesh,type:BUTTON,useinlist:false,useintable:false,useintree:false,visible:true,width:282,x:64,y:432,zorder:18,txtfield:{backcolor:0,bidimode:left-to-right,content:Reflesh,font:3,height:52,highcolor:0,hlayout:center,linespacing:0,multiline:false,name:Reflesh,type:TEXTFIELD,visible:true,vlayout:middle,width:282,wrapline:no-wrap,x:0,y:0}};
itm17={backcolor:0,background:493,ccp:0,ccpzorder:over,height:52,id:22,name:Change_location,type:BUTTON,useinlist:false,useintable:false,useintree:false,visible:true,width:282,x:347,y:432,zorder:19,txtfield:{backcolor:0,bidimode:left-to-right,content:Change location,font:3,height:52,highcolor:0,hlayout:center,linespacing:0,multiline:false,name:Change_location,type:TEXTFIELD,visible:true,vlayout:middle,width:282,wrapline:no-wrap,x:0,y:0}};
itm18={id:23,name:SiriusXM_info,refID:58,type:REFFUNCWIDGET,useinlist:false,useintable:false,useintree:false,visible:true,x:64,y:65,zorder:20};
itm2={id:2,name:Header,refID:2,type:REFFUNCWIDGET,useinlist:false,useintable:false,useintree:false,visible:true,x:3,y:4,zorder:1};
itm3={backcolor:0,height:263,id:3,img:449,layout:normal,name:sxmbase,type:IMAGEFIELD,visible:true,width:560,x:64,y:155,zorder:2,layout_param:{clipx:0,clipy:0}};
itm4={backcolor:0,height:209,id:4,img:452,layout:normal,name:sxmu_icon,type:IMAGEFIELD,visible:true,width:209,x:78,y:198,zorder:3,layout_param:{clipx:0,clipy:0}};
itm5={backcolor:0,background:301,ccp:0,ccpzorder:over,height:74,id:5,name:On_map,type:BUTTON,useinlist:false,useintable:false,useintree:false,visible:true,width:159,x:645,y:155,zorder:4,txtfield:{backcolor:0,bidimode:left-to-right,content:On map,font:3,height:74,highcolor:0,hlayout:center,linespacing:0,multiline:false,name:On_map,type:TEXTFIELD,visible:true,vlayout:middle,width:159,wrapline:no-wrap,x:0,y:0}};
itm6={backcolor:0,background:301,ccp:0,ccpzorder:over,height:74,id:6,name:Time,type:BUTTON,useinlist:false,useintable:false,useintree:false,visible:true,width:159,x:645,y:231,zorder:5,txtfield:{backcolor:0,bidimode:left-to-right,content:3\cm5\cm12hr,font:3,height:74,highcolor:0,hlayout:center,linespacing:0,multiline:false,name:Time,type:TEXTFIELD,visible:true,vlayout:middle,width:159,wrapline:no-wrap,x:0,y:0}};
itm7={backcolor:0,background:301,ccp:0,ccpzorder:over,height:74,id:7,name:Day,type:BUTTON,useinlist:false,useintable:false,useintree:false,visible:true,width:159,x:645,y:307,zorder:6,txtfield:{backcolor:0,bidimode:left-to-right,content:5day,font:3,height:74,highcolor:0,hlayout:center,linespacing:0,multiline:false,name:Day,type:TEXTFIELD,visible:true,vlayout:middle,width:159,wrapline:no-wrap,x:0,y:0}};
itm8={backcolor:0,bidimode:left-to-right,content:City\cm State,font:7,height:35,highcolor:0,hlayout:left,id:8,linespacing:0,multiline:false,name:City_State,type:TEXTFIELD,visible:true,vlayout:middle,width:250,wrapline:no-wrap,x:64,y:122,zorder:7};
itm9={backcolor:0,bidimode:left-to-right,content:Recieved day\cm time,font:7,height:35,highcolor:0,hlayout:left,id:10,linespacing:0,multiline:false,name:Recieved_day_time,type:TEXTFIELD,visible:true,vlayout:middle,width:250,wrapline:no-wrap,x:374,y:122,zorder:8};

